---
kind: method
id: M:Autodesk.Revit.DB.FamilyParameterSetIterator.#ctor
source: html/ce72849d-a113-6a64-f5e4-52593a1e34f8.htm
---
# Autodesk.Revit.DB.FamilyParameterSetIterator.#ctor Method

For Internal Use Only.

## Syntax (C#)
```csharp
public FamilyParameterSetIterator()
```

## Remarks
This constructor is exposed to enable support for COM interop only. This object should never be created by the developer.